{"name": "Enchanted Sapling", "rarity": "Uncommon", "power": "2", "toughness": "2", "type": "Creature — Treefolk", "text": "When Enchanted Sapling enters the battlefield, create a 1/1 green Saproling creature token.\n\nLandfall — Whenever a land enters the battlefield under your control, put a +1/+1 counter on Enchanted Sapling.", "manaCost": "{2}{G}"}
{"name": "Ember Sprite", "rarity": "Uncommon", "power": "1", "toughness": "1", "type": "Creature — Faerie", "text": "Flash (You may cast this spell any time you could cast an instant.)\nWhen Ember Sprite enters the battlefield, it deals 1 damage to any target. If that target is a creature, Ember Sprite gets +1/+0 until end of turn.", "flavor": "A spark in the night, a flicker of rage.", "manaCost": "{1}{R}"}
{"name": "Faerie Protector", "rarity": "Uncommon", "power": "1", "toughness": "2", "type": "Creature — Faerie", "text": "{W}: Another target creature you control gains hexproof until end of turn. (It can't be the target of spells or abilities your opponents control.)", "flavor": "In the heart of the enchanted forest, even the smallest creatures can wield powerful protective magic.", "manaCost": "{2}{W}"}
{"name": "Faerie Illusionist", "rarity": "Uncommon", "power": "2", "toughness": "2", "type": "Creature - Faerie Wizard", "text": "Flying. {1}{U}, Tap: Create a token that's a copy of Faerie Illusionist. It gains 'When this creature becomes the target of a spell or ability, sacrifice it.'", "flavor": "The more you see, the less you know.", "manaCost": "{2}{U}"}
{"name": "Enchanted Grove", "rarity": "Uncommon", "type": "Land", "abilities": [{"tap": "Add one mana of any color to your mana pool."}, {"tap, sacrifice Enchanted Grove": "Search your library for a Forest card and put it onto the battlefield. Then shuffle your library."}], "flavor": "The forest's magic nurtures all who tread its paths."}
{"name": "Faerie's Bargain", "rarity": "Uncommon", "type": "Instant", "text": "As an additional cost to cast Faerie's Bargain, sacrifice a creature. Draw cards equal to the sacrificed creature's toughness instead of its power.", "manaCost": "{2}{B}"}
